app/controllers/authors/accounts_controller.rb

        def update_info
            if current_author.update(author_info_params)
---
UPDATE "authors" SET "bio" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["bio", "ojbgoper g eprg"], ["updated_at", "2017-08-20 20:02:35.445547"], ["id", 1]]