app/controllers/authors/posts_controller.rb

    def create
      @post = current_author.posts.new(post_params)

      respond_to do |format|
        if @post.save
---
INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "gttn"], ["body", ""], ["description", ""], ["slug", "gttn"], ["created_at", "2017-08-16 04:55:14.823574"], ["updated_at", "2017-08-16 04:55:14.823574"], ["banner_image_url", ""]]

    def update
      respond_to do |format|
        if @post.update(post_params)
---
UPDATE "posts" SET "banner_image_url" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["banner_image_url", "https://images.pexels.com/photos/57644/pexels-photo-57644.jpeg?h=350&auto=compress&cs=tinysrgb"], ["updated_at", "2017-08-16 05:07:23.717307"], ["id", 6]]

      def set_post
        @post = current_author.posts.friendly.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC  [["author_id", 1]]